webtemplates/CC.ORBITAL.FC.XML

<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Body><NewOrder xmlns="urn:ws.paymentech.net/PaymentechGateway"><newOrderRequest xsi:type="ns1:NewOrderRequestElement" xmlns:ns1="urn:ws.paymentech.net/PaymentechGateway" xmlns=""><ns1:industryType>EC</ns1:industryType><ns1:transType>[TRANS.TYPE]</ns1:transType><ns1:bin>[CC.BIN]</ns1:bin><ns1:merchantID>[CC.LOGIN]</ns1:merchantID><ns1:terminalID>[TERM.ID]</ns1:terminalID><ns1:ccAccountNum>[CC.NUM]</ns1:ccAccountNum><ns1:ccExp>[CC.EXP.DT]</ns1:ccExp><ns1:ccCardVerifyNum>[CC.CVV.NUM]</ns1:ccCardVerifyNum><ns1:avsZip>[CC.AVS.ZIP]</ns1:avsZip><ns1:avsAddress1>[CC.AVS.ADDR]</ns1:avsAddress1><ns1:avsCountryCode>US</ns1:avsCountryCode><ns1:orderID>[CC.REL.NO]</ns1:orderID><ns1:Comments>[COMMENTS]</ns1:Comments><ns1:taxAmount>[CC.TAX.AMT]</ns1:taxAmount><ns1:amount>[CC.AMOUNT]</ns1:amount><retryTrace>[CC.TRACEVALUE]</retryTrace><ns1:PriorAuthID>[CC.AUTH.ID]</ns1:PriorAuthID></newOrderRequest></NewOrder></soapenv:Body></soapenv:Envelope>
